backend/modules/ucenter/controllers/UserController.php

    public function actionUserList()
    {
        // $return = Member::find()->asArray()->all();
        // echo json_encode($return);
        $post = Yii::$app->request->post();
        $page = isset($post['page']) ? $post['page'] : 1;
        $rows = isset($post['rows']) ? $post['rows'] : 20;
        $query = User::find();
        foreach ($post as $key => $value) {
            switch ($key) {
                case 'uname':
                    if($value){
                        $query->where(['like',"{{%user}}.".$key,$value]);
                    }
                    break;
                case 'studyid':
                    if($value){
                        $query->andWhere(['like',"{{%user}}.".$key,$value]);
                    }
                    break;
                case 'in_crowd':
                    if($value){
                        $query->andWhere(["{{%user}}.".$key=>$value]);
                    }
                    break;
            }
        }
        $countQuery = clone $query;
        $total = $countQuery->count();
        // $response = $query->joinWith('info')->joinWith('agency')
        $response = $query->joinWith('info')
            ->offset($rows*($page-1))
            ->limit($rows)
            ->orderBy(['regtime'=>SORT_DESC])
            ->asArray()
            ->all();
---
SELECT `hql_user`.* FROM `hql_user` LEFT JOIN `hql_app_userinfo` ON `hql_user`.`uid` = `hql_app_userinfo`.`uid` ORDER BY `regtime` DESC LIMIT 20 OFFSET 2380