backend/models/Manager.php

SELECT * FROM `hql_manager` WHERE (`login_name`='admin') AND (`status`=1)
---
    public function validateUser($params)
    {
        $this->login_name = $params['login_name'];
        $manager = $this->find('mid,login_name,real_name,password')->where(['login_name'=>$this->login_name,'status'=>1])->one();