backend/models/Menu.php

    public function getByTag($sm_tag)
    {
        // $menu = $this->find()->where(['sm_tag'=>$sm_tag])->orderBy('sm_weight')->asArray()->all();
        $menu = $this->find()->where(['sm_tag'=>$sm_tag,'sm_status'=>self::ACTIVE_MENU])->orderBy('sm_weight')->asArray()->all();
---
SELECT * FROM `hql_menu` WHERE (`sm_tag`='search') AND (`sm_status`=1) ORDER BY `sm_weight`