backend/models/SysModule.php

    public function getAll()
    {
        return $this->find()->where(['mo_status'=>self::ACTIVE_MODULE])->orderBy('mo_weight')->asArray()->all();
---
SELECT * FROM `hql_module` WHERE `mo_status`=1 ORDER BY `mo_weight`