backend/modules/weixin/controllers/HandleController.php

SELECT * FROM `hql_weixin_message`
SELECT * FROM `hql_weixin_news` WHERE `status`=0
---
    public function actionKeys()
    {
        $message=WeixinMessage::find()->all();
        $news=WeixinNews::find()->where(['status'=>0])->all();

SELECT * FROM `hql_weixin_key`
SELECT * FROM `hql_weixin_message` WHERE `id`='3'
SELECT * FROM `hql_weixin_news` WHERE `id`='1'
---
    public function actionKeysList()
    {
        $data = WeixinKey::find()->asArray()->all();
        if(!empty($data)){
            foreach($data as $key=>$val){
                if($data[$key]['type']==1){
                    $data[$key]['typename']="消息";
                    $message=WeixinMessage::find()->where(['id'=>$data[$key]['return_id']])->one();
                    $data[$key]['title']=$message->title;
                }else if($data[$key]['type']==2){
                    $data[$key]['typename']="图文";
                    $news=WeixinNews::find()->where(['id'=>$data[$key]['return_id']])->one();