backend/modules/group/controllers/GroupTypeController.php

SELECT * FROM `hql_manager` WHERE `mid`='1'
---
    public function actionTypeAdd()
    {
        $post = Yii::$app->request->post();
        $model = new GroupType();
        $model->loadValue( Yii::$app->request->post() );
        $model->gt_time = time();
        $model->gt_creater = Yii::$app->session->get('manager')->mid;